performance-test-reports/main/12532585183/1/user-registration/user_registration/run.log
-    █ [Create Account Service]

-      █ should be able to register new user successfully

-        ✓ is status 200
-        ✓ response body
-        ✓ expected status to equal 200
-        ✓ expected user registration api response to equal 'User Registered'

-    checks.........................: 100.00% ✓ 2404      ✗ 0    
-    data_received..................: 115 kB  1.9 kB/s
-    data_sent......................: 170 kB  2.8 kB/s
-    group_duration.................: avg=11.28ms  min=3.49ms   med=4.43ms   max=720.62ms p(90)=5.03ms   p(95)=5.62ms  
-    http_req_blocked...............: avg=243.95µs min=151.65µs med=246.04µs max=399.4µs  p(90)=283.79µs p(95)=296.91µs
-    http_req_connecting............: avg=179.65µs min=112.32µs med=181.26µs max=253.85µs p(90)=212.21µs p(95)=221.11µs
-  ✓ http_req_duration..............: avg=10.07ms  min=2.47ms   med=3.23ms   max=719.47ms p(90)=3.83ms   p(95)=4.5ms   
-      { expected_response:true }...: avg=10.07ms  min=2.47ms   med=3.23ms   max=719.47ms p(90)=3.83ms   p(95)=4.5ms   
-  ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 601  
-    http_req_receiving.............: avg=84.21µs  min=48.17µs  med=86.15µs  max=150.8µs  p(90)=103.23µs p(95)=108.96µs
-    http_req_sending...............: avg=47.23µs  min=25.05µs  med=46.3µs   max=98.54µs  p(90)=60.12µs  p(95)=65.49µs 
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=9.94ms   min=2.37ms   med=3.09ms   max=719.34ms p(90)=3.68ms   p(95)=4.37ms  
-    http_reqs......................: 601     10.013806/s
-    iteration_duration.............: avg=11.35ms  min=3.55ms   med=4.51ms   max=720.67ms p(90)=5.1ms    p(95)=5.68ms  
-    iterations.....................: 601     10.013806/s
-    vus............................: 0       min=0       max=1  
-    vus_max........................: 200     min=200     max=200